CREATE TABLE ramen_list (
    id INT AUTO_INCREMENT,    -- 主キー
    name VARCHAR(50) NOT NULL, -- 店名
    ramen_img VARCHAR(255),    -- ラーメン画像
    tag_1 VARCHAR(32),         -- タグ1
    tag_2 VARCHAR(32),         -- タグ2
    tag_3 VARCHAR(32),         -- タグ3
    PRIMARY KEY(id)
);

INSERT INTO ramen_list(name, ramen_img, tag_1, tag_2, tag_3)
VALUES
    ("本家アロチ丸高中華そば",
    "img_1.svg",
    "#車庫前系",
    "#ネギ多め",
    "#あっさり"
    ),
    ("井出商店",
    "img_2.svg",
    "#井出系",
    "#濃厚豚骨",
    "#ご飯必須"
    ),
    ("山為食堂",
    "img_3.svg",
    "#独自系",
    "#老舗",
    "#濃厚"
    ),
    ("中華そば専門店　正善",
    "img_2.svg",
    "#井出系",
    "#まろやか",
    "#濃厚寄り"
    ),
    ("グリーンコーナー",
    "img_1.svg",
    "#車庫前系",
    "#天かす入",
    "#名物"
    ),
    ("龍王亭",
    "img_3.svg",
    "#独自系",
    "#濃淡中間",
    "#角煮入り"
    ),
    ("まるイ",
    "img_1.svg",
    "#車庫前系",
    "#ネギ多め",
    "#コッテリ"
    ),
    ("まる豊",
    "img_2.svg",
    "#井出系",
    "#濃厚豚骨",
    "#コッテリ"
    ),
    ("中華そば　丸田屋",
    "img_2.svg",
    "#井出系",
    "#ご飯必須",
    "#濃厚"
    ),
    ("ばり嗎",
    "img_3.svg",
    "#独自系",
    "#チェーン",
    "#鶏ガラ"
    ),
    ("京橋　幸太郎",
    "img_1.svg",
    "#車庫前系",
    "#あっさり",
    "#軽やか"
    ),
    ("丸美商店",
    "img_1.svg",
    "#車庫前系",
    "#あっさり",
    "#地元密着"
    ),
    ("麺屋ひしお",
    "img_3.svg",
    "#独自系",
    "#鶏ガラ",
    "#真っ黒"
    ),
    ("中華そば　まるだい",
    "img_2.svg",
    "#井出系",
    "#ネギ多め",
    "#濃厚豚骨"
    ),
    ("中華そば　まるみ",
    "img_1.svg",
    "#車庫前系",
    "#ネギ多め",
    "#あっさり"
    ),
    ("福井食堂",
    "img_3.svg",
    "#独自系",
    "#濃厚",
    "#地元密着"
    ),
    ("まる京　中華そば",
    "img_3.svg",
    "#独自系",
    "#あっさり",
    "#軽やか"
    ),
    ("丸三",
    "img_2.svg",
    "#井出系",
    "#コッテリ",
    "#濃厚"
    )
;